mkj/imxrt-pacs/svd/MIMXRT1011.svd
        <register>
          <name>DONE2_3_ERR_IRQ</name>
          <description>ETC DONE_2, DONE_3 and DONE_ERR IRQ State Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIG0_DONE2</name>
              <description>TRIG0 done2 interrupt detection.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG0_DONE2_0</name>
                  <description>No TRIG0_DONE2 interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG0_DONE2_1</name>
                  <description>TRIG0_DONE2 interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG1_DONE2</name>
              <description>TRIG1 done2 interrupt detection.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG1_DONE2_0</name>
                  <description>No TRIG1_DONE2 interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG1_DONE2_1</name>
                  <description>TRIG1_DONE2 interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG2_DONE2</name>
              <description>TRIG2 done2 interrupt detection.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG2_DONE2_0</name>
                  <description>No TRIG2_DONE2 interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG2_DONE2_1</name>
                  <description>TRIG2_DONE2 interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG3_DONE2</name>
              <description>TRIG3 done2 interrupt detection.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG3_DONE2_0</name>
                  <description>No TRIG3_DONE2 interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG3_DONE2_1</name>
                  <description>TRIG3_DONE2 interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG4_DONE2</name>
              <description>TRIG4 done2 interrupt detection.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG4_DONE2_0</name>
                  <description>No TRIG4_DONE2 interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG4_DONE2_1</name>
                  <description>TRIG4_DONE2 interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG5_DONE2</name>
              <description>TRIG5 done2 interrupt detection.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG5_DONE2_0</name>
                  <description>No TRIG5_DONE2 interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG5_DONE2_1</name>
                  <description>TRIG5_DONE2 interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG6_DONE2</name>
              <description>TRIG6 done2 interrupt detection.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG6_DONE2_0</name>
                  <description>No TRIG6_DONE2 interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG6_DONE2_1</name>
                  <description>TRIG6_DONE2 interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG7_DONE2</name>
              <description>TRIG7 done2 interrupt detection.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG7_DONE2_0</name>
                  <description>No TRIG7_DONE2 interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG7_DONE2_1</name>
                  <description>TRIG7_DONE2 interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG0_DONE3</name>
              <description>TRIG0 done3 interrupt detection.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG0_DONE3_0</name>
                  <description>No TRIG0_DONE3 interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG0_DONE3_1</name>
                  <description>TRIG0_DONE3 interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG1_DONE3</name>
              <description>TRIG1 done3 interrupt detection.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG1_DONE3_0</name>
                  <description>No TRIG1_DONE3 interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG1_DONE3_1</name>
                  <description>TRIG1_DONE3 interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG2_DONE3</name>
              <description>TRIG2 done3 interrupt detection.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG2_DONE3_0</name>
                  <description>No TRIG2_DONE3 interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG2_DONE3_1</name>
                  <description>TRIG2_DONE3 interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG3_DONE3</name>
              <description>TRIG3 done3 interrupt detection.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG3_DONE3_0</name>
                  <description>No TRIG3_DONE3 interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG3_DONE3_1</name>
                  <description>TRIG3_DONE3 interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG4_DONE3</name>
              <description>TRIG4 done3 interrupt detection.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG4_DONE3_0</name>
                  <description>No TRIG4_DONE3 interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG4_DONE3_1</name>
                  <description>TRIG4_DONE3 interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG5_DONE3</name>
              <description>TRIG5 done3 interrupt detection.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG5_DONE3_0</name>
                  <description>No TRIG5_DONE3 interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG5_DONE3_1</name>
                  <description>TRIG5_DONE3 interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG6_DONE3</name>
              <description>TRIG6 done3 interrupt detection.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG6_DONE3_0</name>
                  <description>No TRIG6_DONE3 interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG6_DONE3_1</name>
                  <description>TRIG6_DONE3 interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG7_DONE3</name>
              <description>TRIG7 done3 interrupt detection.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG7_DONE3_0</name>
                  <description>No TRIG7_DONE3 interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG7_DONE3_1</name>
                  <description>TRIG7_DONE3 interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG0_ERR</name>
              <description>TRIG0 error interrupt detection.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG0_ERR_0</name>
                  <description>No TRIG0_ERR interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG0_ERR_1</name>
                  <description>TRIG0_ERR interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG1_ERR</name>
              <description>TRIG1 error interrupt detection.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG1_ERR_0</name>
                  <description>No TRIG1_ERR interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG1_ERR_1</name>
                  <description>TRIG1_ERR interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG2_ERR</name>
              <description>TRIG2 error interrupt detection.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG2_ERR_0</name>
                  <description>No TRIG2_ERR interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG2_ERR_1</name>
                  <description>TRIG2_ERR interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG3_ERR</name>
              <description>TRIG3 error interrupt detection.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG3_ERR_0</name>
                  <description>No TRIG3_ERR interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG3_ERR_1</name>
                  <description>TRIG3_ERR interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG4_ERR</name>
              <description>TRIG4 error interrupt detection.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG4_ERR_0</name>
                  <description>No TRIG4_ERR interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG4_ERR_1</name>
                  <description>TRIG4_ERR interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG5_ERR</name>
              <description>TRIG5 error interrupt detection.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG5_ERR_0</name>
                  <description>No TRIG5_ERR interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG5_ERR_1</name>
                  <description>TRIG5_ERR interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG6_ERR</name>
              <description>TRIG6 error interrupt detection.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG6_ERR_0</name>
                  <description>No TRIG6_ERR interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG6_ERR_1</name>
                  <description>TRIG6_ERR interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG7_ERR</name>
              <description>TRIG7 error interrupt detection.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG7_ERR_0</name>
                  <description>No TRIG7_ERR interrupt detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG7_ERR_1</name>
                  <description>TRIG7_ERR interrupt detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
