mkj/imxrt-pacs/svd/MIMXRT1011.svd
        <register>
          <name>TRIG2_CTRL</name>
          <description>ETC_TRIG Control Register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SW_TRIG</name>
              <description>Software trigger. This field is self-clearing.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SW_TRIG_0</name>
                  <description>No software trigger event generated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_TRIG_1</name>
                  <description>Software trigger event generated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG_MODE</name>
              <description>Trigger mode selection.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG_MODE_0</name>
                  <description>Hardware trigger. The softerware trigger will be ignored.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_MODE_1</name>
                  <description>Software trigger. The hardware trigger will be ignored.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG_CHAIN</name>
              <description>The number of segments inside the trigger chain of TRIGa.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG_CHAIN_0</name>
                  <description>Trigger chain length is 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CHAIN_1</name>
                  <description>Trigger chain length is 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CHAIN_2</name>
                  <description>Trigger chain length is 3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CHAIN_3</name>
                  <description>Trigger chain length is 4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CHAIN_4</name>
                  <description>Trigger chain length is 5</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CHAIN_5</name>
                  <description>Trigger chain length is 6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CHAIN_6</name>
                  <description>Trigger chain length is 7</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CHAIN_7</name>
                  <description>Trigger chain length is 8</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG_PRIORITY</name>
              <description>External trigger priority, 7 is highest priority, while 0 is lowest</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC_MODE</name>
              <description>Trigger synchronization mode selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYNC_MODE_0</name>
                  <description>Synchronization mode disabled, TRIGa and TRIG(a+4) are triggered independently.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNC_MODE_1</name>
                  <description>Synchronization mode enabled, TRIGa and TRIG(a+4) are triggered by TRIGa source synchronously.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIG2_COUNTER</name>
          <description>ETC_TRIG Counter Register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INIT_DELAY</name>
              <description>TRIGGER initial delay counter. Initial_delay = (INIT_DELAY+1)*(PRE_DIVIDER+1)*ipg_clk</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAMPLE_INTERVAL</name>
              <description>TRIGGER sampling interval counter</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
