mkj/imxrt-pacs/svd/MIMXRT1011.svd
        <register>
          <name>TRIG2_CHAIN_1_0</name>
          <description>ETC_TRIG Chain 0/1 Register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSEL0</name>
              <description>ADC channel selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CSEL0_0</name>
                  <description>ADC Channel 0 selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL0_1</name>
                  <description>ADC Channel 1 selected.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL0_2</name>
                  <description>ADC Channel 2 selected.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL0_3</name>
                  <description>ADC Channel 3 selected.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL0_4</name>
                  <description>ADC Channel 4 selected.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL0_5</name>
                  <description>ADC Channel 5 selected.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL0_6</name>
                  <description>ADC Channel 6 selected.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL0_7</name>
                  <description>ADC Channel 7 selected.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL0_8</name>
                  <description>ADC Channel 8 selected.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL0_9</name>
                  <description>ADC Channel 9 selected.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL0_10</name>
                  <description>ADC Channel 10 selected.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL0_11</name>
                  <description>ADC Channel 11 selected.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL0_12</name>
                  <description>ADC Channel 12 selected.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL0_13</name>
                  <description>ADC Channel 13 selected.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL0_14</name>
                  <description>ADC Channel 14 selected.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL0_15</name>
                  <description>ADC Channel 15 selected.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HWTS0</name>
              <description>Segment 0 HWTS ADC hardware trigger selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HWTS0_0</name>
                  <description>no trigger selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS0_1</name>
                  <description>ADC TRIG0 selected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS0_2</name>
                  <description>ADC TRIG1 selected</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS0_4</name>
                  <description>ADC TRIG2 selected</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS0_8</name>
                  <description>ADC TRIG3 selected</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS0_16</name>
                  <description>ADC TRIG4 selected</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS0_32</name>
                  <description>ADC TRIG5 selected</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS0_64</name>
                  <description>ADC TRIG6 selected</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS0_128</name>
                  <description>ADC TRIG7 selected</description>
                  <value>0x80</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>B2B0</name>
              <description>Segment 0 B2B</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B2B0_0</name>
                  <description>Disable B2B. Wait until delay value defined by TRIG0_COUNTER[SAMPLE_INTERVAL] is reached</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B2B0_1</name>
                  <description>Enable B2B. When Segment 0 finished (ADC COCO) then automatically trigger next ADC conversion, no need to wait until interval delay reached.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IE0</name>
              <description>Segment 0 interrupt enable. (This bit field is meaningful only when IE0_EN is set)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IE0_0</name>
                  <description>Generate interrupt on Done0 when segment 0 finish.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IE0_1</name>
                  <description>Generate interrupt on Done1 when segment 0 finish.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IE0_2</name>
                  <description>Generate interrupt on Done2 when segment 0 finish.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IE0_3</name>
                  <description>Generate interrupt on Done3 when segment 0 finish.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IE0_EN</name>
              <description>IRQ enable of segment 0.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IE0_EN_0</name>
                  <description>Interrupt DONE disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IE0_EN_1</name>
                  <description>Interrupt DONE enabled. When segment 0 finish, an interrupt will be generated on the specific port configured by the IE0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSEL1</name>
              <description>ADC channel selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CSEL1_0</name>
                  <description>ADC Channel 0 selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL1_1</name>
                  <description>ADC Channel 1 selected.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL1_2</name>
                  <description>ADC Channel 2 selected.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL1_3</name>
                  <description>ADC Channel 3 selected.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL1_4</name>
                  <description>ADC Channel 4 selected.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL1_5</name>
                  <description>ADC Channel 5 selected.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL1_6</name>
                  <description>ADC Channel 6 selected.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL1_7</name>
                  <description>ADC Channel 7 selected.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL1_8</name>
                  <description>ADC Channel 8 selected.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL1_9</name>
                  <description>ADC Channel 9 selected.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL1_10</name>
                  <description>ADC Channel 10 selected.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL1_11</name>
                  <description>ADC Channel 11 selected.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL1_12</name>
                  <description>ADC Channel 12 selected.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL1_13</name>
                  <description>ADC Channel 13 selected.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL1_14</name>
                  <description>ADC Channel 14 selected.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL1_15</name>
                  <description>ADC Channel 15 selected.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HWTS1</name>
              <description>Segment 1 HWTS ADC hardware trigger selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HWTS1_0</name>
                  <description>no trigger selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS1_1</name>
                  <description>ADC TRIG0 selected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS1_2</name>
                  <description>ADC TRIG1 selected</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS1_4</name>
                  <description>ADC TRIG2 selected</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS1_8</name>
                  <description>ADC TRIG3 selected</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS1_16</name>
                  <description>ADC TRIG4 selected</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS1_32</name>
                  <description>ADC TRIG5 selected</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS1_64</name>
                  <description>ADC TRIG6 selected</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS1_128</name>
                  <description>ADC TRIG7 selected</description>
                  <value>0x80</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>B2B1</name>
              <description>Segment 1 B2B</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B2B1_0</name>
                  <description>Disable B2B. Wait until delay value defined by TRIG1_COUNTER[SAMPLE_INTERVAL] is reached</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B2B1_1</name>
                  <description>Enable B2B. When Segment 0 finished (ADC COCO) then automatically trigger next ADC conversion, no need to wait until interval delay reached.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IE1</name>
              <description>Segment 1 interrupt enable. (This bit field is meaningful only when IE1_EN is set)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IE1_0</name>
                  <description>Generate interrupt on Done0 when Segment 1 finish.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IE1_1</name>
                  <description>Generate interrupt on Done1 when Segment 1 finish.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IE1_2</name>
                  <description>Generate interrupt on Done2 when Segment 1 finish.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IE1_3</name>
                  <description>Generate interrupt on Done3 when Segment 1 finish.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IE1_EN</name>
              <description>IRQ enable of segment 1.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IE1_EN_0</name>
                  <description>Interrupt DONE disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IE1_EN_1</name>
                  <description>Interrupt DONE enabled. When segment 1 finish, an interrupt will be generated on the specific port configured by the IE1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
