mkj/imxrt-pacs/svd/MIMXRT1011.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>OTFAD</name>
      <description>OTFAD</description>
      <alternatePeripheral>FLEXSPI</alternatePeripheral>
      <groupName>OTFAD</groupName>
      <baseAddress>0x400A0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xDE0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <description>Control Register</description>
          <addressOffset>0xC00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FERR</name>
              <description>Force Error</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No effect on the SR[KBERE] indicator.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE_ERROR</name>
                  <description>SR[KBERR] is immediately set after a write with this data bit set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSVM</name>
              <description>Force Security Violation Mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No effect on the operating mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE_SVM</name>
                  <description>Force entry into SVM after a write with this data bit set and the data bit associated with FLDM cleared. SR[MODE] signals the operating mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLDM</name>
              <description>Force Logically Disabled Mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No effect on the operating mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE_LDM</name>
                  <description>Force entry into LDM after a write with this data bit set. SR[MODE] signals the operating mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KBSE</name>
              <description>Key Blob Scramble Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Key blob KEK scrambling is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Key blob KEK scrambling is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KBPE</name>
              <description>Key Blob Processing Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Key blob processing is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Key blob processing is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RRAE</name>
              <description>Restricted Register Access Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Register access is fully enabled. The OTFAD programming model registers can be accessed "normally".</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESTRICT</name>
                  <description>Register access is restricted and only the CR, SR and optional MDPC registers can be accessed; others are treated as RAZ/WI.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SKBP</name>
              <description>Start key blob processing</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>Key blob processing is not initiated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INIT_KB</name>
                  <description>Properly-enabled key blob processing is initiated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GE</name>
              <description>Global OTFAD Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>OTFAD has decryption disabled. All data fetched by the FlexSPI bypasses OTFAD processing.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>OTFAD has decryption enabled, and processes data fetched by the FlexSPI as defined by the hardware configuration.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Status Register</description>
          <addressOffset>0xC04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KBERR</name>
              <description>Key Blob Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_KB_ERR</name>
                  <description>No key blob error detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KB_ERR</name>
                  <description>One or more key blob errors has been detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MDPCP</name>
              <description>MDPC Present</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MODE</name>
              <description>Operating Mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Operating in Normal mode (NRM)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES_01</name>
                  <description>Unused (reserved)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES_10_SVM</name>
                  <description>Operating in Security Violation Mode (SVM)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDM</name>
                  <description>Operating in Logically Disabled Mode (LDM)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NCTX</name>
              <description>Number of Contexts</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CTXER0</name>
              <description>Context Error</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOERROR</name>
                  <description>No key blob error was detected for context "n".</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERROR</name>
                  <description>A key blob integrity error might have been detected in context "n".</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTXER1</name>
              <description>Context Error</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOERROR</name>
                  <description>No key blob error was detected for context "n".</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERROR</name>
                  <description>A key blob integrity error might have been detected in context "n".</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTXER2</name>
              <description>Context Error</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOERROR</name>
                  <description>No key blob error was detected for context "n".</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERROR</name>
                  <description>A key blob integrity error might have been detected in context "n".</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTXER3</name>
              <description>Context Error</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOERROR</name>
                  <description>No key blob error was detected for context "n".</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERROR</name>
                  <description>A key blob integrity error might have been detected in context "n".</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTXIE0</name>
              <description>Context Integrity Error</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOINTEGRITYERR</name>
                  <description>No key blob integrity error was detected for context "n".</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTEGRITYERR</name>
                  <description>A key blob integrity error was detected in context "n".</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTXIE1</name>
              <description>Context Integrity Error</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOINTEGRITYERR</name>
                  <description>No key blob integrity error was detected for context "n".</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTEGRITYERR</name>
                  <description>A key blob integrity error was detected in context "n".</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTXIE2</name>
              <description>Context Integrity Error</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOINTEGRITYERR</name>
                  <description>No key blob integrity error was detected for context "n".</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTEGRITYERR</name>
                  <description>A key blob integrity error was detected in context "n".</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTXIE3</name>
              <description>Context Integrity Error</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOINTEGRITYERR</name>
                  <description>No key blob integrity error was detected for context "n".</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTEGRITYERR</name>
                  <description>A key blob integrity error was detected in context "n".</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HRL</name>
              <description>Hardware Revision Level</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RRAM</name>
              <description>Restricted Register Access Mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Register access is fully enabled. The OTFAD programming model registers can be accessed "normally".</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESTRICTED</name>
                  <description>Register access is restricted and only the CR, SR and optional MDPC registers can be accessed; others are treated as RAZ/WI.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GEM</name>
              <description>Global Enable Mode</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>OTFAD is disabled. All data fetched by the FlexSPI bypasses OTFAD processing.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>OTFAD is enabled, and processes data fetched by the FlexSPI as defined by the hardware configuration.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KBPE</name>
              <description>Key Blob Processing Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Key blob processing is not enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Key blob processing is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KBD</name>
              <description>Key Blob Processing Done</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_DONE</name>
                  <description>Key blob processing was not enabled, or is not complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DONE</name>
                  <description>Key blob processing was enabled and is complete.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>4</dim>
          <dimIncrement>0x40</dimIncrement>
          <name>CTX[%s]</name>
          <description>no description available</description>
          <addressOffset>0xD00</addressOffset>
          <register>
            <dim>4</dim>
            <dimIncrement>0x4</dimIncrement>
            <dimIndex>0,1,2,3</dimIndex>
            <name>CTX_KEY%s</name>
            <description>AES Key Word</description>
            <addressOffset>0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>KEY</name>
                <description>AES Key</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>2</dim>
            <dimIncrement>0x4</dimIncrement>
            <dimIndex>0,1</dimIndex>
            <name>CTX_CTR%s</name>
            <description>AES Counter Word</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CTR</name>
                <description>AES Counter</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CTX_RGD_W0</name>
            <description>AES Region Descriptor Word0</description>
            <addressOffset>0x18</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SRTADDR</name>
                <description>Start Address</description>
                <bitOffset>10</bitOffset>
                <bitWidth>22</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
