mkj/imxrt-pacs/svd/MIMXRT1011.svd
        <register>
          <name>REG_CORE_CLR</name>
          <description>Digital Regulator Core Register</description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x482012</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REG0_TARG</name>
              <description>This field defines the target voltage for the Arm core power domain</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REG0_TARG_0</name>
                  <description>Power gated off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG0_TARG_1</name>
                  <description>Target core voltage = 0.725V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG0_TARG_2</name>
                  <description>Target core voltage = 0.750V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG0_TARG_3</name>
                  <description>Target core voltage = 0.775V</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG0_TARG_16</name>
                  <description>Target core voltage = 1.100V</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG0_TARG_30</name>
                  <description>Target core voltage = 1.450V</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG0_TARG_31</name>
                  <description>Power FET switched full on. No regulation.</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REG0_ADJ</name>
              <description>This bit field defines the adjustment bits to calibrate the target value of Reg0. The adjustment is applied on top on any adjustment applied to the global reference in the misc0 register.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REG0_ADJ_0</name>
                  <description>No adjustment</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG0_ADJ_1</name>
                  <description>+ 0.25%</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG0_ADJ_2</name>
                  <description>+ 0.50%</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG0_ADJ_3</name>
                  <description>+ 0.75%</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG0_ADJ_4</name>
                  <description>+ 1.00%</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG0_ADJ_5</name>
                  <description>+ 1.25%</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG0_ADJ_6</name>
                  <description>+ 1.50%</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG0_ADJ_7</name>
                  <description>+ 1.75%</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG0_ADJ_8</name>
                  <description>- 0.25%</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG0_ADJ_9</name>
                  <description>- 0.50%</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG0_ADJ_10</name>
                  <description>- 0.75%</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG0_ADJ_11</name>
                  <description>- 1.00%</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG0_ADJ_12</name>
                  <description>- 1.25%</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG0_ADJ_13</name>
                  <description>- 1.50%</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG0_ADJ_14</name>
                  <description>- 1.75%</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG0_ADJ_15</name>
                  <description>- 2.00%</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REG1_TARG</name>
              <description>This bit field defines the target voltage for the vpu/gpu power domain. Single bit increments reflect 25mV core voltage steps. Not all steps will make sense to use either because of input supply limitations or load operation.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REG1_TARG_0</name>
                  <description>Power gated off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG1_TARG_1</name>
                  <description>Target core voltage = 0.725V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG1_TARG_2</name>
                  <description>Target core voltage = 0.750V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG1_TARG_3</name>
                  <description>Target core voltage = 0.775V</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG1_TARG_16</name>
                  <description>Target core voltage = 1.100V</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG1_TARG_30</name>
                  <description>Target core voltage = 1.450V</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG1_TARG_31</name>
                  <description>Power FET switched full on. No regulation.</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REG1_ADJ</name>
              <description>This bit field defines the adjustment bits to calibrate the target value of Reg1. The adjustment is applied on top on any adjustment applied to the global reference in the misc0 register.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REG1_ADJ_0</name>
                  <description>No adjustment</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG1_ADJ_1</name>
                  <description>+ 0.25%</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG1_ADJ_2</name>
                  <description>+ 0.50%</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG1_ADJ_3</name>
                  <description>+ 0.75%</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG1_ADJ_4</name>
                  <description>+ 1.00%</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG1_ADJ_5</name>
                  <description>+ 1.25%</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG1_ADJ_6</name>
                  <description>+ 1.50%</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG1_ADJ_7</name>
                  <description>+ 1.75%</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG1_ADJ_8</name>
                  <description>- 0.25%</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG1_ADJ_9</name>
                  <description>- 0.50%</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG1_ADJ_10</name>
                  <description>- 0.75%</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG1_ADJ_11</name>
                  <description>- 1.00%</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG1_ADJ_12</name>
                  <description>- 1.25%</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG1_ADJ_13</name>
                  <description>- 1.50%</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG1_ADJ_14</name>
                  <description>- 1.75%</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG1_ADJ_15</name>
                  <description>- 2.00%</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REG2_TARG</name>
              <description>This field defines the target voltage for the SOC power domain</description>
              <bitOffset>18</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REG2_TARG_0</name>
                  <description>Power gated off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG2_TARG_1</name>
                  <description>Target core voltage = 0.725V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG2_TARG_2</name>
                  <description>Target core voltage = 0.750V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG2_TARG_3</name>
                  <description>Target core voltage = 0.775V</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG2_TARG_16</name>
                  <description>Target core voltage = 1.100V</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG2_TARG_30</name>
                  <description>Target core voltage = 1.450V</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG2_TARG_31</name>
                  <description>Power FET switched full on. No regulation.</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REG2_ADJ</name>
              <description>This bit field defines the adjustment bits to calibrate the target value of Reg2. The adjustment is applied on top on any adjustment applied to the global reference in the misc0 register.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REG2_ADJ_0</name>
                  <description>No adjustment</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG2_ADJ_1</name>
                  <description>+ 0.25%</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG2_ADJ_2</name>
                  <description>+ 0.50%</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG2_ADJ_3</name>
                  <description>+ 0.75%</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG2_ADJ_4</name>
                  <description>+ 1.00%</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG2_ADJ_5</name>
                  <description>+ 1.25%</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG2_ADJ_6</name>
                  <description>+ 1.50%</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG2_ADJ_7</name>
                  <description>+ 1.75%</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG2_ADJ_8</name>
                  <description>- 0.25%</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG2_ADJ_9</name>
                  <description>- 0.50%</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG2_ADJ_10</name>
                  <description>- 0.75%</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG2_ADJ_11</name>
                  <description>- 1.00%</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG2_ADJ_12</name>
                  <description>- 1.25%</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG2_ADJ_13</name>
                  <description>- 1.50%</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG2_ADJ_14</name>
                  <description>- 1.75%</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG2_ADJ_15</name>
                  <description>- 2.00%</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAMP_RATE</name>
              <description>Regulator voltage ramp rate.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RAMP_RATE_0</name>
                  <description>Fast</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAMP_RATE_1</name>
                  <description>Medium Fast</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAMP_RATE_2</name>
                  <description>Medium Slow</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAMP_RATE_3</name>
                  <description>Slow</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FET_ODRIVE</name>
              <description>If set, increases the gate drive on power gating FETs to reduce leakage in the off state</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
