mkj/imxrt-pacs/svd/MIMXRT1011.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CCM</name>
      <description>CCM</description>
      <groupName>CCM</groupName>
      <prependToName>CCM_</prependToName>
      <baseAddress>0x400FC000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x8C</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CCM_1</name>
        <value>42</value>
      </interrupt>
      <interrupt>
        <name>CCM_2</name>
        <value>43</value>
      </interrupt>
      <registers>
        <register>
          <name>CCR</name>
          <description>CCM Control Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x401107F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OSCNT</name>
              <description>Oscillator ready counter value. These bits define value of 32KHz counter, that serve as counter for oscillator lock time (count to n+1 ckil's). This is used for oscillator lock time. Current estimation is ~5ms. This counter will be used in ignition sequence and in wake from stop sequence if sbyos bit was defined, to notify that on chip oscillator output is ready for the dpll_ip to use and only then the gate in dpll_ip can be opened.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COSC_EN</name>
              <description>On chip oscillator enable bit - this bit value is reflected on the output cosc_en</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COSC_EN_0</name>
                  <description>disable on chip oscillator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COSC_EN_1</name>
                  <description>enable on chip oscillator</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REG_BYPASS_COUNT</name>
              <description>Counter for analog_reg_bypass signal assertion after standby voltage request by PMIC_STBY_REQ</description>
              <bitOffset>21</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REG_BYPASS_COUNT_0</name>
                  <description>no delay</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG_BYPASS_COUNT_1</name>
                  <description>1 CKIL clock period delay</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG_BYPASS_COUNT_63</name>
                  <description>63 CKIL clock periods delay</description>
                  <value>0x3F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RBC_EN</name>
              <description>Enable for REG_BYPASS_COUNTER</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RBC_EN_0</name>
                  <description>REG_BYPASS_COUNTER disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RBC_EN_1</name>
                  <description>REG_BYPASS_COUNTER enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR</name>
          <description>CCM Status Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x10</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REF_EN_B</name>
              <description>Status of the value of CCM_REF_EN_B output of ccm</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REF_EN_B_0</name>
                  <description>value of CCM_REF_EN_B is '0'</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REF_EN_B_1</name>
                  <description>value of CCM_REF_EN_B is '1'</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAMP2_READY</name>
              <description>Status indication of CAMP2.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAMP2_READY_0</name>
                  <description>CAMP2 is not ready.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAMP2_READY_1</name>
                  <description>CAMP2 is ready.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COSC_READY</name>
              <description>Status indication of on board oscillator</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COSC_READY_0</name>
                  <description>on board oscillator is not ready.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COSC_READY_1</name>
                  <description>on board oscillator is ready.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCSR</name>
          <description>CCM Clock Switcher Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL3_SW_CLK_SEL</name>
              <description>Selects source to generate pll3_sw_clk. This bit should only be used for testing purposes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLL3_SW_CLK_SEL_0</name>
                  <description>pll3_main_clk</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL3_SW_CLK_SEL_1</name>
                  <description>pll3 bypass clock</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CBCDR</name>
          <description>CCM Bus Clock Divider Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x28000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IPG_PODF</name>
              <description>Divider for ipg podf.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IPG_PODF_0</name>
                  <description>divide by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPG_PODF_1</name>
                  <description>divide by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPG_PODF_2</name>
                  <description>divide by 3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPG_PODF_3</name>
                  <description>divide by 4</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHB_PODF</name>
              <description>Divider for AHB PODF</description>
              <bitOffset>10</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AHB_PODF_0</name>
                  <description>divide by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_PODF_1</name>
                  <description>divide by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_PODF_2</name>
                  <description>divide by 3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_PODF_3</name>
                  <description>divide by 4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_PODF_4</name>
                  <description>divide by 5</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_PODF_5</name>
                  <description>divide by 6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_PODF_6</name>
                  <description>divide by 7</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_PODF_7</name>
                  <description>divide by 8</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PERIPH_CLK_SEL</name>
              <description>Selector for peripheral main clock</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PERIPH_CLK_SEL_0</name>
                  <description>derive clock selected by CCM_CBCMR[CORE_CLK_PRE_SEL]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIPH_CLK_SEL_1</name>
                  <description>derive clock selected by CCM_CBCMR[PERIPH_CLK2_SEL]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CBCMR</name>
          <description>CCM Bus Clock Multiplexer Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC088020</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPSPI_CLK_SEL</name>
              <description>Selector for lpspi clock multiplexer</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI_CLK_SEL_0</name>
                  <description>derive clock from PLL3 PFD1 clk</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI_CLK_SEL_1</name>
                  <description>derive clock from PLL3 PFD0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI_CLK_SEL_2</name>
                  <description>derive clock from PLL2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI_CLK_SEL_3</name>
                  <description>derive clock from PLL2 PFD2</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PERIPH_CLK2_SEL</name>
              <description>Selector for peripheral clk2 clock multiplexer</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PERIPH_CLK2_SEL_0</name>
                  <description>derive clock from pll3_sw_clk</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIPH_CLK2_SEL_1</name>
                  <description>derive clock from osc_clk</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIPH_CLK2_SEL_2</name>
                  <description>derive clock from pll2_bypass_clk</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRACE_CLK_SEL</name>
              <description>Selector for Trace clock multiplexer</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRACE_CLK_SEL_0</name>
                  <description>derive clock from PLL2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRACE_CLK_SEL_1</name>
                  <description>derive clock from PLL2 PFD2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRACE_CLK_SEL_2</name>
                  <description>derive clock from PLL2 PFD0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRACE_CLK_SEL_3</name>
                  <description>derive clock from PLL2 PFD1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRE_PERIPH_CLK_SEL</name>
              <description>Selector for pre_periph clock multiplexer</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRE_PERIPH_CLK_SEL_0</name>
                  <description>derive clock from PLL2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRE_PERIPH_CLK_SEL_1</name>
                  <description>derive clock from PLL3 PFD3</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRE_PERIPH_CLK_SEL_2</name>
                  <description>derive clock from PLL2 PFD3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRE_PERIPH_CLK_SEL_3</name>
                  <description>derive clock from PLL6</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI_PODF</name>
              <description>Divider for LPSPI. Divider should be updated when output clock is gated.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI_PODF_0</name>
                  <description>divide by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI_PODF_1</name>
                  <description>divide by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI_PODF_2</name>
                  <description>divide by 3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI_PODF_3</name>
                  <description>divide by 4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI_PODF_4</name>
                  <description>divide by 5</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI_PODF_5</name>
                  <description>divide by 6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI_PODF_6</name>
                  <description>divide by 7</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI_PODF_7</name>
                  <description>divide by 8</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI_PODF_8</name>
                  <description>divide by 9</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI_PODF_9</name>
                  <description>divide by 10</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI_PODF_10</name>
                  <description>divide by 11</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI_PODF_11</name>
                  <description>divide by 12</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI_PODF_12</name>
                  <description>divide by 13</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI_PODF_13</name>
                  <description>divide by 14</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI_PODF_14</name>
                  <description>divide by 15</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI_PODF_15</name>
                  <description>divide by 16</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
