mkj/imxrt-pacs/svd/MIMXRT1011.svd
        <register>
          <name>LPI2C2_SDA_SELECT_INPUT</name>
          <description>LPI2C2_SDA_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x1CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_AD_07_ALT0</name>
                  <description>Selecting Pad: GPIO_AD_07 for Mode: ALT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_AD_01_ALT3</name>
                  <description>Selecting Pad: GPIO_AD_01 for Mode: ALT3</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SD_07_ALT1</name>
                  <description>Selecting Pad: GPIO_SD_07 for Mode: ALT1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_09_ALT3</name>
                  <description>Selecting Pad: GPIO_09 for Mode: ALT3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPSPI1_PCS_SELECT_INPUT_0</name>
          <description>LPSPI1_PCS_SELECT_INPUT_0 DAISY Register</description>
          <addressOffset>0x1D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_AD_05_ALT0</name>
                  <description>Selecting Pad: GPIO_AD_05 for Mode: ALT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SD_07_ALT2</name>
                  <description>Selecting Pad: GPIO_SD_07 for Mode: ALT2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPSPI1_SCK_SELECT_INPUT</name>
          <description>LPSPI1_SCK_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x1D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_AD_06_ALT0</name>
                  <description>Selecting Pad: GPIO_AD_06 for Mode: ALT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SD_08_ALT2</name>
                  <description>Selecting Pad: GPIO_SD_08 for Mode: ALT2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPSPI1_SDI_SELECT_INPUT</name>
          <description>LPSPI1_SDI_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x1D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_AD_03_ALT0</name>
                  <description>Selecting Pad: GPIO_AD_03 for Mode: ALT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SD_05_ALT2</name>
                  <description>Selecting Pad: GPIO_SD_05 for Mode: ALT2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPSPI1_SDO_SELECT_INPUT</name>
          <description>LPSPI1_SDO_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x1DC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_AD_04_ALT0</name>
                  <description>Selecting Pad: GPIO_AD_04 for Mode: ALT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SD_06_ALT2</name>
                  <description>Selecting Pad: GPIO_SD_06 for Mode: ALT2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPSPI2_PCS_SELECT_INPUT_0</name>
          <description>LPSPI2_PCS_SELECT_INPUT_0 DAISY Register</description>
          <addressOffset>0x1E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_AD_11_ALT0</name>
                  <description>Selecting Pad: GPIO_AD_11 for Mode: ALT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SD_12_ALT1</name>
                  <description>Selecting Pad: GPIO_SD_12 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPSPI2_SCK_SELECT_INPUT</name>
          <description>LPSPI2_SCK_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x1E4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_AD_12_ALT0</name>
                  <description>Selecting Pad: GPIO_AD_12 for Mode: ALT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SD_11_ALT1</name>
                  <description>Selecting Pad: GPIO_SD_11 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPSPI2_SDI_SELECT_INPUT</name>
          <description>LPSPI2_SDI_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x1E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_AD_09_ALT0</name>
                  <description>Selecting Pad: GPIO_AD_09 for Mode: ALT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SD_09_ALT1</name>
                  <description>Selecting Pad: GPIO_SD_09 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPSPI2_SDO_SELECT_INPUT</name>
          <description>LPSPI2_SDO_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x1EC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_AD_10_ALT0</name>
                  <description>Selecting Pad: GPIO_AD_10 for Mode: ALT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SD_10_ALT1</name>
                  <description>Selecting Pad: GPIO_SD_10 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPUART1_RXD_SELECT_INPUT</name>
          <description>LPUART1_RXD_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x1F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_SD_11_ALT2</name>
                  <description>Selecting Pad: GPIO_SD_11 for Mode: ALT2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_09_ALT0</name>
                  <description>Selecting Pad: GPIO_09 for Mode: ALT0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPUART1_TXD_SELECT_INPUT</name>
          <description>LPUART1_TXD_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x1F4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_SD_12_ALT2</name>
                  <description>Selecting Pad: GPIO_SD_12 for Mode: ALT2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_10_ALT0</name>
                  <description>Selecting Pad: GPIO_10 for Mode: ALT0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPUART2_RXD_SELECT_INPUT</name>
          <description>LPUART2_RXD_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x1F8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_SD_09_ALT2</name>
                  <description>Selecting Pad: GPIO_SD_09 for Mode: ALT2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_13_ALT0</name>
                  <description>Selecting Pad: GPIO_13 for Mode: ALT0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPUART2_TXD_SELECT_INPUT</name>
          <description>LPUART2_TXD_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x1FC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_AD_00_ALT0</name>
                  <description>Selecting Pad: GPIO_AD_00 for Mode: ALT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SD_10_ALT2</name>
                  <description>Selecting Pad: GPIO_SD_10 for Mode: ALT2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPUART3_RXD_SELECT_INPUT</name>
          <description>LPUART3_RXD_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_AD_07_ALT1</name>
                  <description>Selecting Pad: GPIO_AD_07 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_11_ALT0</name>
                  <description>Selecting Pad: GPIO_11 for Mode: ALT0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_07_ALT3</name>
                  <description>Selecting Pad: GPIO_07 for Mode: ALT3</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPUART3_TXD_SELECT_INPUT</name>
          <description>LPUART3_TXD_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_AD_08_ALT1</name>
                  <description>Selecting Pad: GPIO_AD_08 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_12_ALT0</name>
                  <description>Selecting Pad: GPIO_12 for Mode: ALT0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_08_ALT3</name>
                  <description>Selecting Pad: GPIO_08 for Mode: ALT3</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPUART4_RXD_SELECT_INPUT</name>
          <description>LPUART4_RXD_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_AD_01_ALT0</name>
                  <description>Selecting Pad: GPIO_AD_01 for Mode: ALT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_05_ALT3</name>
                  <description>Selecting Pad: GPIO_05 for Mode: ALT3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPUART4_TXD_SELECT_INPUT</name>
          <description>LPUART4_TXD_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x20C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_AD_02_ALT0</name>
                  <description>Selecting Pad: GPIO_AD_02 for Mode: ALT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_06_ALT3</name>
                  <description>Selecting Pad: GPIO_06 for Mode: ALT3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NMI_GLUE_NMI_SELECT_INPUT</name>
          <description>NMI_GLUE_NMI_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_AD_13_ALT6</name>
                  <description>Selecting Pad: GPIO_AD_13 for Mode: ALT6</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_AD_00_ALT6</name>
                  <description>Selecting Pad: GPIO_AD_00 for Mode: ALT6</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SPDIF_IN1_SELECT_INPUT</name>
          <description>SPDIF_IN1_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_10_ALT6</name>
                  <description>Selecting Pad: GPIO_10 for Mode: ALT6</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_04_ALT4</name>
                  <description>Selecting Pad: GPIO_04 for Mode: ALT4</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
