mkj/imxrt-pacs/svd/MIMXRT1011.svd
        <register>
          <name>ID_ISAR3</name>
          <description>Instruction Set Attributes Register 3</description>
          <addressOffset>0xD6C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SATURATE_INSTRS</name>
              <description>Indicates the supported Saturate instructions</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SATURATE_INSTRS_0</name>
                  <description>None supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SATURATE_INSTRS_1</name>
                  <description>Adds support for the QADD, QDADD, QDSUB, and QSUB instructions, and for the Q bit in the PSRs.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIMD_INSTRS</name>
              <description>Indicates the supported SIMD instructions</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIMD_INSTRS_0</name>
                  <description>None supported, ARMv7-M unused.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIMD_INSTRS_1</name>
                  <description>Adds support for the SSAT and USAT instructions, and for the Q bit in the PSRs.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIMD_INSTRS_3</name>
                  <description>As for 1, and adds support for the PKHBT, PKHTB, QADD16, QADD8, QASX, QSUB16, QSUB8, QSAX, SADD16, SADD8, SASX, SEL, SHADD16, SHADD8, SHASX, SHSUB16, SHSUB8, SHSAX, SSAT16, SSUB16, SSUB8, SSAX, SXTAB16, SXTB16, UADD16, UADD8, UASX, UHADD16, UHADD8, UHASX, UHSUB16, UHSUB8, UHSAX, UQADD16, UQADD8, UQASX, UQSUB16, UQSUB8, UQSAX, USAD8, USADA8, USAT16, USUB16, USUB8, USAX, UXTAB16, and UXTB16 instructions. Also adds support for the GE[3:0] bits in the PSRs.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SVC_INSTRS</name>
              <description>Indicates the supported SVC instructions</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SVC_INSTRS_0</name>
                  <description>None supported, ARMv7-M unused.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SVC_INSTRS_1</name>
                  <description>Adds support for the SVC instruction.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCHPRIM_INSTRS</name>
              <description>Together with the ID_ISAR4[SYNCHPRIM_INSTRS_FRAC] indicates the supported Synchronization Primitives</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TABBRANCH_INSTRS</name>
              <description>Indicates the supported Table Branch instructions</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TABBRANCH_INSTRS_0</name>
                  <description>None supported, ARMv7-M unused.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TABBRANCH_INSTRS_1</name>
                  <description>Adds support for the TBB and TBH instructions.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>THUMBCOPY_INSTRS</name>
              <description>Indicates the supported non flag-setting MOV instructions</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THUMBCOPY_INSTRS_0</name>
                  <description>None supported, ARMv7-M unused.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THUMBCOPY_INSTRS_1</name>
                  <description>Adds support for encoding T1 of the MOV (register) instruction copying from a low register to a low register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRUENOP_INSTRS</name>
              <description>Indicates the supported non flag-setting MOV instructions</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRUENOP_INSTRS_0</name>
                  <description>None supported, ARMv7-M unused.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRUENOP_INSTRS_1</name>
                  <description>Adds support for encoding T1 of the MOV (register) instruction copying from a low register to a low register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_ISAR4</name>
          <description>Instruction Set Attributes Register 4</description>
          <addressOffset>0xD70</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UNPRIV_INSTRS</name>
              <description>Indicates the supported unprivileged instructions. These are the instruction variants indicated by a T suffix.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNPRIV_INSTRS_0</name>
                  <description>None supported, ARMv7-M unused.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNPRIV_INSTRS_1</name>
                  <description>Adds support for the LDRBT, LDRT, STRBT, and STRT instructions.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNPRIV_INSTRS_2</name>
                  <description>As for 1, and adds support for the LDRHT, LDRSBT, LDRSHT, and STRHT instructions.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WITHSHIFTS_INSTRS</name>
              <description>Indicates the support for instructions with shifts</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WITHSHIFTS_INSTRS_0</name>
                  <description>Nonzero shifts supported only in MOV and shift instructions.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WITHSHIFTS_INSTRS_1</name>
                  <description>Adds support for shifts of loads and stores over the range LSL 0-3.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WITHSHIFTS_INSTRS_3</name>
                  <description>As for 1, and adds support for other constant shift options, on loads, stores, and other instructions.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WITHSHIFTS_INSTRS_4</name>
                  <description>ARMv7-M unused.</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WRITEBACK_INSTRS</name>
              <description>Indicates the support for Writeback addressing modes</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITEBACK_INSTRS_0</name>
                  <description>Basic support. Only the LDM, STM, PUSH, and POP instructions support writeback addressing modes. ARMv7-M unused.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITEBACK_INSTRS_1</name>
                  <description>Adds support for all of the writeback addressing modes defined in the ARMv7-M architecture.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BARRIER_INSTRS</name>
              <description>Indicates the supported Barrier instructions</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BARRIER_INSTRS_0</name>
                  <description>None supported, ARMv7-M unused.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BARRIER_INSTRS_1</name>
                  <description>Adds support for the DMB, DSB, and ISB barrier instructions.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCHPRIM_INSTRS_FRAC</name>
              <description>Together with the ID_ISAR3[SYNCHPRIM_INSTRS] indicates the supported Synchronization Primitives</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PSR_M_INSTRS</name>
              <description>Indicates the supported M profile instructions to modify the PSRs</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PSR_M_INSTRS_0</name>
                  <description>None supported, ARMv7-M unused.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PSR_M_INSTRS_1</name>
                  <description>Adds support for the M-profile forms of the CPS, MRS, and MSR instructions, to access the PSRs.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
