mkj/imxrt-pacs/svd/MIMXRT1011.svd
        <register>
          <name>CM7_ABFSR</name>
          <description>Auxiliary Bus Fault Status Register</description>
          <addressOffset>0xFA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ITCM</name>
              <description>Asynchronous fault on ITCM interface.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTCM</name>
              <description>Asynchronous fault on DTCM interface.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBP</name>
              <description>Asynchronous fault on AHBP interface.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AXIM</name>
              <description>Asynchronous fault on AXIM interface.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPPB</name>
              <description>Asynchronous fault on EPPB interface.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AXIMTYPE</name>
              <description>Indicates the type of fault on the AXIM interface. Only valid when AXIM is 1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AXIMTYPE_0</name>
                  <description>OKAY.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AXIMTYPE_1</name>
                  <description>EXOKAY.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AXIMTYPE_2</name>
                  <description>SLVERR.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AXIMTYPE_3</name>
                  <description>DECERR.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>NVIC</name>
      <description>Nested Vectored Interrupt Controller</description>
      <groupName>NVIC</groupName>
      <baseAddress>0xE000E100</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xE04</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DMA0</name>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>DMA1</name>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>DMA2</name>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>DMA3</name>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>DMA4</name>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>DMA5</name>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>DMA6</name>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>DMA7</name>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>DMA8</name>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>DMA9</name>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>DMA10</name>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>DMA11</name>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>DMA12</name>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>DMA13</name>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>DMA14</name>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>DMA15</name>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>DMA_ERROR</name>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>CTI0_ERROR</name>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>CTI1_ERROR</name>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>CORE</name>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>LPUART1</name>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>LPUART2</name>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>LPUART3</name>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>LPUART4</name>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>PIT</name>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>USB_OTG1</name>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>FLEXSPI</name>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>FLEXRAM</name>
        <value>27</value>
      </interrupt>
      <interrupt>
        <name>LPI2C1</name>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>LPI2C2</name>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>GPT1</name>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>GPT2</name>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>LPSPI1</name>
        <value>32</value>
      </interrupt>
      <interrupt>
        <name>LPSPI2</name>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>PWM1_0</name>
        <value>34</value>
      </interrupt>
      <interrupt>
        <name>PWM1_1</name>
        <value>35</value>
      </interrupt>
      <interrupt>
        <name>PWM1_2</name>
        <value>36</value>
      </interrupt>
      <interrupt>
        <name>PWM1_3</name>
        <value>37</value>
      </interrupt>
      <interrupt>
        <name>PWM1_FAULT</name>
        <value>38</value>
      </interrupt>
      <interrupt>
        <name>KPP</name>
        <value>39</value>
      </interrupt>
      <interrupt>
        <name>SRC</name>
        <value>40</value>
      </interrupt>
      <interrupt>
        <name>GPR_IRQ</name>
        <value>41</value>
      </interrupt>
      <interrupt>
        <name>CCM_1</name>
        <value>42</value>
      </interrupt>
      <interrupt>
        <name>CCM_2</name>
        <value>43</value>
      </interrupt>
      <interrupt>
        <name>EWM</name>
        <value>44</value>
      </interrupt>
      <interrupt>
        <name>WDOG2</name>
        <value>45</value>
      </interrupt>
      <interrupt>
        <name>SNVS_HP_WRAPPER</name>
        <value>46</value>
      </interrupt>
      <interrupt>
        <name>SNVS_HP_WRAPPER_TZ</name>
        <value>47</value>
      </interrupt>
      <interrupt>
        <name>SNVS_LP_WRAPPER</name>
        <value>48</value>
      </interrupt>
      <interrupt>
        <name>CSU</name>
        <value>49</value>
      </interrupt>
      <interrupt>
        <name>DCP</name>
        <value>50</value>
      </interrupt>
      <interrupt>
        <name>DCP_VMI</name>
        <value>51</value>
      </interrupt>
      <interrupt>
        <name>Reserved68</name>
        <value>52</value>
      </interrupt>
      <interrupt>
        <name>TRNG</name>
        <value>53</value>
      </interrupt>
      <interrupt>
        <name>Reserved70</name>
        <value>54</value>
      </interrupt>
      <interrupt>
        <name>Reserved71</name>
        <value>55</value>
      </interrupt>
      <interrupt>
        <name>SAI1</name>
        <value>56</value>
      </interrupt>
      <interrupt>
        <name>RTWDOG</name>
        <value>57</value>
      </interrupt>
      <interrupt>
        <name>SAI3_RX</name>
        <value>58</value>
      </interrupt>
      <interrupt>
        <name>SAI3_TX</name>
        <value>59</value>
      </interrupt>
      <interrupt>
        <name>SPDIF</name>
        <value>60</value>
      </interrupt>
      <interrupt>
        <name>PMU</name>
        <value>61</value>
      </interrupt>
      <interrupt>
        <name>XBAR1_IRQ_0_1_2_3</name>
        <value>62</value>
      </interrupt>
      <interrupt>
        <name>TEMP_LOW_HIGH</name>
        <value>63</value>
      </interrupt>
      <interrupt>
        <name>TEMP_PANIC</name>
        <value>64</value>
      </interrupt>
      <interrupt>
        <name>USB_PHY</name>
        <value>65</value>
      </interrupt>
      <interrupt>
        <name>GPC</name>
        <value>66</value>
      </interrupt>
      <interrupt>
        <name>ADC1</name>
        <value>67</value>
      </interrupt>
      <interrupt>
        <name>FLEXIO1</name>
        <value>68</value>
      </interrupt>
      <interrupt>
        <name>DCDC</name>
        <value>69</value>
      </interrupt>
      <interrupt>
        <name>GPIO1_Combined_0_15</name>
        <value>70</value>
      </interrupt>
      <interrupt>
        <name>GPIO1_Combined_16_31</name>
        <value>71</value>
      </interrupt>
      <interrupt>
        <name>GPIO2_Combined_0_15</name>
        <value>72</value>
      </interrupt>
      <interrupt>
        <name>GPIO5_Combined_0_15</name>
        <value>73</value>
      </interrupt>
      <interrupt>
        <name>WDOG1</name>
        <value>74</value>
      </interrupt>
      <interrupt>
        <name>ADC_ETC_IRQ0</name>
        <value>75</value>
      </interrupt>
      <interrupt>
        <name>ADC_ETC_IRQ1</name>
        <value>76</value>
      </interrupt>
      <interrupt>
        <name>ADC_ETC_IRQ2</name>
        <value>77</value>
      </interrupt>
      <interrupt>
        <name>ADC_ETC_IRQ3</name>
        <value>78</value>
      </interrupt>
      <interrupt>
        <name>ADC_ETC_ERROR_IRQ</name>
        <value>79</value>
      </interrupt>
      <registers>
        <register>
          <name>NVICISER0</name>
          <description>Interrupt Set Enable Register n</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETENA</name>
              <description>Interrupt set enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICISER1</name>
          <description>Interrupt Set Enable Register n</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETENA</name>
              <description>Interrupt set enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICISER2</name>
          <description>Interrupt Set Enable Register n</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETENA</name>
              <description>Interrupt set enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICISER3</name>
          <description>Interrupt Set Enable Register n</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETENA</name>
              <description>Interrupt set enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICICER0</name>
          <description>Interrupt Clear Enable Register n</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLRENA</name>
              <description>Interrupt clear-enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICICER1</name>
          <description>Interrupt Clear Enable Register n</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLRENA</name>
              <description>Interrupt clear-enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICICER2</name>
          <description>Interrupt Clear Enable Register n</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLRENA</name>
              <description>Interrupt clear-enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICICER3</name>
          <description>Interrupt Clear Enable Register n</description>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLRENA</name>
              <description>Interrupt clear-enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICISPR0</name>
          <description>Interrupt Set Pending Register n</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETPEND</name>
              <description>Interrupt set-pending bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICISPR1</name>
          <description>Interrupt Set Pending Register n</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETPEND</name>
              <description>Interrupt set-pending bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICISPR2</name>
          <description>Interrupt Set Pending Register n</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETPEND</name>
              <description>Interrupt set-pending bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICISPR3</name>
          <description>Interrupt Set Pending Register n</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETPEND</name>
              <description>Interrupt set-pending bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICICPR0</name>
          <description>Interrupt Clear Pending Register n</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLRPEND</name>
              <description>Interrupt clear-pending bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICICPR1</name>
          <description>Interrupt Clear Pending Register n</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLRPEND</name>
              <description>Interrupt clear-pending bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICICPR2</name>
          <description>Interrupt Clear Pending Register n</description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLRPEND</name>
              <description>Interrupt clear-pending bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICICPR3</name>
          <description>Interrupt Clear Pending Register n</description>
          <addressOffset>0x18C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLRPEND</name>
              <description>Interrupt clear-pending bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICIABR0</name>
          <description>Interrupt Active bit Register n</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACTIVE</name>
              <description>Interrupt active flags</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICIABR1</name>
          <description>Interrupt Active bit Register n</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACTIVE</name>
              <description>Interrupt active flags</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICIABR2</name>
          <description>Interrupt Active bit Register n</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACTIVE</name>
              <description>Interrupt active flags</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
